system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v12                                   |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Domain: 2m (x) x 2.5m (y/height) x 1m (z/depth)
// Server rack: 0.6m x 2m x 0.8m centered in domain

scale 1;

// Domain boundaries
xMin 0;
xMax 2;
yMin 0;
yMax 2.5;
zMin 0;
zMax 1;

// Rack position (centered in x and z)
rackXMin 0.7;
rackXMax 1.3;
rackYMin 0.1;
rackYMax 2.1;
rackZMin 0.1;
rackZMax 0.9;

vertices
(
    // Domain corners
    ($xMin $yMin $zMin)   // 0
    ($xMax $yMin $zMin)   // 1
    ($xMax $yMax $zMin)   // 2
    ($xMin $yMax $zMin)   // 3
    ($xMin $yMin $zMax)   // 4
    ($xMax $yMin $zMax)   // 5
    ($xMax $yMax $zMax)   // 6
    ($xMin $yMax $zMax)   // 7
    
    // Rack front face (x = rackXMin)
    ($rackXMin $rackYMin $rackZMin)   // 8
    ($rackXMin $rackYMax $rackZMin)   // 9
    ($rackXMin $rackYMin $rackZMax)   // 10
    ($rackXMin $rackYMax $rackZMax)   // 11
    
    // Rack back face (x = rackXMax)
    ($rackXMax $rackYMin $rackZMin)   // 12
    ($rackXMax $rackYMax $rackZMin)   // 13
    ($rackXMax $rackYMin $rackZMax)   // 14
    ($rackXMax $rackYMax $rackZMax)   // 15
);

blocks
(
    // Main block (simplified - full domain without rack cutout for initial mesh)
    // For complex geometry, use snappyHexMesh
    hex (0 1 2 3 4 5 6 7) (40 50 20) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)  // Left wall as inlet (cold aisle)
        );
    }
    
    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)  // Right wall as outlet (hot aisle)
        );
    }
    
    floor
    {
        type wall;
        faces
        (
            (0 1 5 4)  // Bottom
        );
    }
    
    ceiling
    {
        type wall;
        faces
        (
            (3 7 6 2)  // Top
        );
    }
    
    frontAndBack
    {
        type wall;
        faces
        (
            (0 3 2 1)  // Front (z = 0)
            (4 5 6 7)  // Back (z = 1)
        );
    }
);

// ************************************************************************* //
