system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v12                                   |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       true;

geometry
{
    serverRack
    {
        type searchableBox;
        min (0.7 0.1 0.1);
        max (1.3 2.1 0.9);
    }
    
    // Individual server units (simplified as heat sources)
    server1
    {
        type searchableBox;
        min (0.72 0.15 0.12);
        max (1.28 0.40 0.88);
    }
    server2
    {
        type searchableBox;
        min (0.72 0.45 0.12);
        max (1.28 0.70 0.88);
    }
    server3
    {
        type searchableBox;
        min (0.72 0.75 0.12);
        max (1.28 1.00 0.88);
    }
    server4
    {
        type searchableBox;
        min (0.72 1.05 0.12);
        max (1.28 1.30 0.88);
    }
    server5
    {
        type searchableBox;
        min (0.72 1.35 0.12);
        max (1.28 1.60 0.88);
    }
    server6
    {
        type searchableBox;
        min (0.72 1.65 0.12);
        max (1.28 1.90 0.88);
    }
}

castellatedMeshControls
{
    maxLocalCells   100000;
    maxGlobalCells  2000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 3;
    
    features
    (
    );
    
    refinementSurfaces
    {
        serverRack
        {
            level (2 2);
            patchInfo
            {
                type wall;
                inGroups (rackGroup);
            }
        }
        
        server1
        {
            level (3 3);
            patchInfo
            {
                type wall;
                inGroups (serverGroup);
            }
        }
        server2
        {
            level (3 3);
            patchInfo
            {
                type wall;
                inGroups (serverGroup);
            }
        }
        server3
        {
            level (3 3);
            patchInfo
            {
                type wall;
                inGroups (serverGroup);
            }
        }
        server4
        {
            level (3 3);
            patchInfo
            {
                type wall;
                inGroups (serverGroup);
            }
        }
        server5
        {
            level (3 3);
            patchInfo
            {
                type wall;
                inGroups (serverGroup);
            }
        }
        server6
        {
            level (3 3);
            patchInfo
            {
                type wall;
                inGroups (serverGroup);
            }
        }
    }
    
    resolveFeatureAngle 30;
    
    refinementRegions
    {
        serverRack
        {
            mode inside;
            levels ((1e15 2));
        }
    }
    
    locationInMesh (0.1 1.0 0.5);
    
    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch    3;
    tolerance       2.0;
    nSolveIter      100;
    nRelaxIter      5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}

addLayersControls
{
    relativeSizes   true;
    
    layers
    {
        "server.*"
        {
            nSurfaceLayers 3;
        }
        serverRack
        {
            nSurfaceLayers 2;
        }
    }
    
    expansionRatio  1.2;
    finalLayerThickness 0.3;
    minThickness    0.1;
    nGrow           0;
    featureAngle    60;
    slipFeatureAngle 30;
    nRelaxIter      5;
    nSmoothSurfaceNormals 1;
    nSmoothNormals  3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedialAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter      50;
}

meshQualityControls
{
    maxNonOrtho     65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave      80;
    minVol          1e-13;
    minTetQuality   -1e30;
    minArea         -1;
    minTwist        0.02;
    minDeterminant  0.001;
    minFaceWeight   0.05;
    minVolRatio     0.01;
    minTriangleTwist -1;
    
    nSmoothScale    4;
    errorReduction  0.75;
    
    relaxed
    {
        maxNonOrtho 75;
    }
}

mergeTolerance  1e-6;

// ************************************************************************* //
