system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  12                                    |
|   \\  /    A nd           | Website:  www.openfoam.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // Create cell set for server rack region
    {
        name    serverRackCellSet;
        type    cellSet;
        action  new;
        source  boxToCell;
        box     (0.7 0.1 0.1) (1.3 2.1 0.9);
    }
    
    // Convert to cell zone
    {
        name    serverRack;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        set     serverRackCellSet;
    }
);

// ************************************************************************* //
